burger-store/app/controllers/carts_controller.rb

    def index
        user = User.find_by id: 2 #<---PostMAN  session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]