burger-store/app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1  [["cart_id", 3]]
---
    def index
        cart = Cart.find_by user_id: session[:user_id]
        cart_item_names = cart.items.map do |item|