burger-store/app/controllers/inventories_controller.rb

    def index
        user = User.find_by id: session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        inventory = Inventory.find_by location_id: params[:id]
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."location_id" = $1 LIMIT $2  [["location_id", 1], ["LIMIT", 1]]