burger-store/app/controllers/items_controller.rb

     def create
        manager = User.find_by is_manager: true
        manager_cart = Cart.find_by user_id: manager.id
        sliders = manager_cart.items.find_by name: "Sliders"
        onion_rings = manager_cart.items.find_by name: "Onion Rings"
        fries = manager_cart.items.find_by name: "Fries"
        user = User.find_by id: session[:user_id]
        user_cart = Cart.find_by user_id: user.id
         if params[:name] == "Sliders"
             price = sliders.price
         elsif params[:name] == "Fries"
             price = fries.price
         elsif params[:name] == "Onion Rings"
             price = onion_rings.price
         end

         item = Item.create cart_id: user_cart.id, name: params[:name], price: price
---
SELECT "users".* FROM "users" WHERE "users"."is_manager" = $1 LIMIT $2  [["is_manager", true], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1 AND "items"."name" = $2 LIMIT $3  [["cart_id", 1], ["name", "Sliders"], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1 AND "items"."name" = $2 LIMIT $3  [["cart_id", 1], ["name", "Onion Rings"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
INSERT INTO "items" ("name", "cart_id", "created_at", "updated_at", "price") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Sliders"], ["cart_id", 4], ["created_at", "2023-01-06 05:08:32.073179"], ["updated_at", "2023-01-06 05:08:32.073179"], ["price", 1.0]]

     def update
        manager = User.find_by is_manager: true
        cart = Cart.find_by user_id: manager.id
        item = Item.find_by cart_id: cart.id, name: params[:name]
        current_price = item.price
        item.update price: current_price + 0.21
---
SELECT "users".* FROM "users" WHERE "users"."is_manager" = $1 LIMIT $2  [["is_manager", true], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1 AND "items"."name" = $2 LIMIT $3  [["cart_id", 1], ["name", "Sliders"], ["LIMIT", 1]]
UPDATE "items" SET "updated_at" = $1, "price" = $2 WHERE "items"."id" = $3  [["updated_at", "2023-01-06 17:33:27.548870"], ["price", 14.01], ["id", 1]]

    def destroy
        # user = User.find_by id: session[:user_id]
        cart = Cart.find_by user_id: session[:user_id]
        item = Item.find_by name: params[:name], cart_id: cart.id
        item.destroy
        cart_item_names = cart.items.map do |item|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."name" = $1 AND "items"."cart_id" = $2 LIMIT $3  [["name", ":name"], ["cart_id", 12], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 9]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1  [["cart_id", 12]]