burger-store/app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "location_id", "created_at", "updated_at", "sliders", "onion_rings", "fries") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["location_id", 1], ["created_at", "2023-01-06 04:16:17.876273"], ["updated_at", "2023-01-06 04:16:17.876273"], ["sliders", 2], ["onion_rings", 1], ["fries", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 12]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2023-01-06 04:16:17.907040"], ["updated_at", "2023-01-06 04:16:17.907040"]]
---
    def create
        byebug
        # name_list = params[:_json].map do |item|
        #     item["name"]
        # end
        # item_tally = name_list.tally
    order = Order.create location_id: 1, user_id: session[:user_id], sliders: params["Sliders"], onion_rings: params["Onion Rings"], fries: params["Fries"]
    user = User.find_by id: session[:user_id]
    user.cart.destroy
    Cart.create user_id: user.id