burger-store/app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "username", "created_at", "updated_at", "is_manager") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["password_digest", "[FILTERED]"], ["username", "Phil"], ["created_at", "2023-01-05 16:07:01.482329"], ["updated_at", "2023-01-05 16:07:01.482329"], ["is_manager", nil]]
---
    def create
        user =
            User.create username: params[:username],
                                    password: params[:password],
                                    password_confirmation: params[:password_confirmation]

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        user = User.find_by id: session[:user_id]