burger-store/app/models/cart.rb

SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1  [["cart_id", 3]]
---
    def get_items
        items = self.items
        items.map do |item|